#include <stdio.h>

// C枚举名缺名场, 不同枚举内不可同名
// 不如C++有场枚举好
enum 周
{
    一 = 1,
    二, // 值接前名 = 2
    三, // = 3
    四,
    五,
    六,
    日
};
enum 月
{
    // 一至六与周内同名, 报错重复定义
    // 一 = 1,
    // 二, // 值接前名 = 2
    // 三, // = 3
    // 四,
    // 五,
    // 六,
    七,
    八,
    九,
    十,
    十一,
    十二
};

// 默认从0赋值
enum 三原色
{
    红, // = 0
    绿, // = 1
    蓝 // =2
};

// 可指定每个名称之值
enum 转义符 {
    铃 = '\a',
    退格 = '\b',
    横跳格 = '\t',
    纵跳格 = '\v',
    新行 = '\n',
    回车 = '\r',
    喂纸 = '\f'
};

int main(int argc, char const *argv[])
{
    
    printf("%d月周%d听铃声%d.\n", 三, 日, 铃);
    return 0;
}
