#include <stdio.h>

// 找两列中相同的数
int 找同(int 列1[], int 列2[], int 列1长, int 列2长)
{
    int 号1, 号2;
    for(号1=0; 号1<列1长; 号1++)
        for(号2=0; 号2<列2长; 号2++)
            if(列1[号1] == 列2[号2]) goto 找到;

    // 没找到
    printf("两列无同数.\n");
    return -1;            
找到:
    printf("第一列%d号与第二列%d号同为%d\n", 号1, 号2, 列1[号1]);
    return 号1;
}

// 找两列中相同的数
int 找同2(int 列1[], int 列2[], int 列1长, int 列2长)
{
    int 号1, 号2;
    int 找到 = 0;
    for(号1=0; 号1<列1长; 号1++)
        for(号2=0; 号2<列2长; 号2++)
            if(列1[号1] == 列2[号2]){
                printf("第一列%d号与第二列%d号同为%d\n", 号1, 号2, 列1[号1]);
                找到 = 1;
                return 号1;
            }

    // 没找到
    printf("两列无同数.\n");
    return 找到;            
}

// 找列中相同的数
int 找同3(int 列[], int 列长)
{
    int 号1, 号2;
    for(号1=0; 号1<列长; 号1++)
        for(号2=0; 号2<列长; 号2++)
            if(列[号1] == 列[号2] && 号1 != 号2) goto 找到;

    // 没找到
    printf("此列数无重复.\n");
    return -1;            
找到:
    printf("第%d号与第%d号同为%d\n", 号1, 号2, 列[号1]);
    return 号1;
}

int main(int argc, char const *argv[])
{
    int 列1[] = {1,6,0,2,1,7,6,6,3,4}, 列1长 = 10;
    int 列2[] = {9,8,7,6,5,4,3,2,1}, 列2长 = 9;

    找同(列1, 列2, 列1长, 列2长);
    找同2(列1, 列2, 列1长, 列2长);

    找同3(列1, 列1长);
    找同3(列2, 列2长);

    return 0;
}

/*练习
7. 改写找同3, 去除goto.
8. 改进这些函数, 找出所有相同的数.
*/
