#include <stdio.h>

#define 词内 1
#define 词外 0

int main(int argc, char const *argv[])
{
    // 计行、词与字
    int 字, 字数, 词数, 行数, 光标位;

    字数 = 词数 = 行数 = 0;
    光标位 = 词外;
    while ((字 = getchar()) != EOF)
    {
        ++字数;
        if (字 == '\n')
        {
            行数++;
        }
        // 连续空格、跳格和换行导致误计
        if (字 == ' ' || 字 == '\t' || 字 == '\n')
        {
            光标位 = 词外;
        }
        else if (光标位 == 词外)
        {
            光标位 = 词内;
            ++词数;
        }
    }
    printf("字数=%d 词数=%d 行数=%d\n", 字数, 词数, 行数);

    return 0;
}

/* 练习
8. 写程序计空格数、跳格数及行数。
9. 写程序，复制输入至输出，并将连续空格换成单个。
10. 写程序，复制输入至输出，并将空格换成空字、跳格换成跳字、退格换成退字、反斜杠换成\\。
*/
