#include <stdio.h>

static char 每月日数[2][13] = {
    {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}, // 平年
    {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31} // 闰年
};

int 算年日(int 年, int 月, int 日)
{
    int 月号, 闰;
    闰 = 年%4 == 0 && 年%100 != 0 || 年%400 == 0;
    for(月号=1; 月号 < 月; 月号++)
        日 += 每月日数[闰][月号];

    return 日;
}

void 算月日(int 年, int 年日, int *月指, int *日指)
{
    int 月号, 闰;
    闰 = 年%4 == 0 && 年%100 != 0 || 年%400 == 0;
    for(月号=1; 年日 > 每月日数[闰][月号]; 月号++)
        年日 -= 每月日数[闰][月号];
    *月指 = 月号;
    *日指 = 年日;
}

// 二维列
char *中英日名(int 语, int 日)
{
    static char *日名[][7] = {
        {"一","二","三","四","五","六","七"},
        {"水","火","木","金","土","气","虫"},
        {"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"}
    };

    return 日名[语][日-1];
}
enum 语言{
    中文,
    文言,
    英文
};

int main(int argc, char const *argv[])
{
    int 年 = 2022, 月 =12, 日=24;
    int 年日;
    printf("%d年%d月%d日是该年第%d日.\n", 年,月,日, 年日 = 算年日(年,月,日));
    算月日(年, 年日, &月, &日);
    printf("%d年第%d日是%d月%d日.\n", 年, 年日, 月, 日);

    printf("周%s文言名%s英文名%s\n", 中英日名(中文,4), 中英日名(文言,4), 中英日名(英文,4));

    return 0;
}

/*练习
8. 在算年日和算月日内增加实参检查, 即其值需有效.
9. 写函式转换某年某周某日及年日、月日。
10. 以指代号重写上述函式.
*/
